
/*7．执行以下代码段，将产生什么样的输出？请对输出加以解释，并手动计算代码中 t 的值。*/

#include <stdio.h>

int main(int argc, char *argv[])
{

    char x = -2, y = 3;
    // (1000,0001)|(0000,0011) 原码
    //　(1111,1111) |(0000,0011) 补码
    // 1111,1111 (补码结果)
    //　%d 转为原码（-1）

    char t = (++x) | (y++);

    printf("x = %d, y = %d, t = %d\n", x, y, t); // -1,4,-1

    //同上

    t = (++x) || (y++);

    printf("x = %d, y = %d, t = %d\n", x, y, t); //x = 0, y = 5, t = 1

    return 0;
}
/*
 ./a.out 

x = -1, y = 4, t = -1
x = 0, y = 5, t = 1

*/